;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

(package! catppuccin-theme)

(package! auto-dark)

(package! langtool)

(package! org-fancy-priorities)

(package! org-roam-bibtex)

(package! org-auto-tangle)

(package! typst-ts-mode :recipe (:host codeberg :repo "meow_king/typst-ts-mode"))
(package! typst-preview :recipe (:host github :repo "havarddj/typst-preview.el"))

(package! kdl-mode)

(package! evil-tutor)
